# Vaccine-YOLOv10 (Ours)

# Parameters
nc: 1 # number of classes
scales: 
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024] 

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 3, C2f_Faster, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 6, C2f_Faster, [256, True]]
  - [-1, 1, SCDown, [512, 3, 2]] 
  - [-1, 6, C2f_Faster, [512, True]]
  - [-1, 1, SCDown, [1024, 3, 2]] 
  - [-1, 3, C2f_Faster, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]
  - [-1, 1, PSA, [1024]]

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] 
  - [-1, 3, C2f_Faster, [512]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 3, C2f_Faster, [256]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 3, C2f_Faster, [512]]

  - [-1, 1, SCDown, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 3, C2fCIB, [1024, True, True]]

  - [[16, 19, 22], 1, v10Detect, [nc]]
